app/controllers/events_controller.rb

  def show
    if current_user
      @event = Event.find(params['id'])
      @creator = User.find(@event.creator_id)
      event_attending = EventAttendee.where(event_id: params[:id])
      @attendees = []
      event_attending.each do |a|
        @attendees.push(User.find(a.attendee_id))
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."event_id" = $1  [["event_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def create
    event = Event.create(description: params[:event][:description],
        place: params[:event][:place],
        date: Date.parse(params[:event][:date]),
        price: params[:event][:price].to_i
    )
    event.creator = User.find(current_user.id)
---
INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "creator_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "hafa"], ["date", "2018-05-19 00:00:00"], ["place", "hafa be"], ["created_at", "2018-05-08 20:44:24.124364"], ["updated_at", "2018-05-08 20:44:24.124364"], ["creator_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def suscribe
    attending = EventAttendee.new
    event = Event.find(params[:id])
    attending.event = event
    attending.attendee = User.find(current_user.id)

    if !(attending.valid?)
      redirect_to home_path
    end

    # Amount in cents
    @amount = event.price

    customer = Stripe::Customer.create(
      :email => params[:stripeEmail],
      :source  => params[:stripeToken]
    )

    charge = Stripe::Charge.create(
      :customer    => customer.id,
      :amount      => @amount,
      :description => 'Rails Stripe customer',
      :currency    => 'usd'
    )

    attending.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "event_attendees" ("event_id", "attendee_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["event_id", 1], ["attendee_id", 2], ["created_at", "2018-05-09 13:11:09.619313"], ["updated_at", "2018-05-09 13:11:09.619313"]]