app/controllers/users_controller.rb

    def show
        if current_user
            @events = Event.where(creator_id: current_user.id)
---
SELECT "events".* FROM "events" WHERE "events"."creator_id" = $1  [["creator_id", 1]]

    def view_user
        if params[:id]
            @user = User.find(params[:id])
            @event_attended = EventAttendee.where(attendee_id: params['id'])
            @events = []
            @event_attended.each do |e|
                @events.push(Event.find(e.event_id))
            end
        else
            redirect_to new_event_path
        end
        event_attending = EventAttendee.where(attendee_id: params[:id])
        @attendees = []
        event_attending.each do |a|
            @attendees.push(User.find(a.attendee_id))
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."attendee_id" = $1  [["attendee_id", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]